run/StraightChannel/power_law/SC_PL_PB_default/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application directory
application=`getApplication`

runApplication blockMesh

echo "Running $application and ouputing to null."
$application>/dev/null

runApplication postProcess -func sampleDict -latestTime
